exercises/exercise_00_Vorbereitung.tex
% Created 2025-12-31 Mi 14:00
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Vorbereitung in der Praxisphase}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Vorbereitung in der Praxisphase},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Vorbereitung in der Praxisphase}}
\label{sec:orgbf29881}
\subsection{\textbf{Zahlensysteme und Mengen}}
\label{sec:org3d402bb}
\subsubsection{\textbf{Zahlensysteme}}
\label{sec:orgbc6d1ba}

Unser Alltag basiert auf dem Zehnersystem, einem Zahlensystem, das auf
der Zahl zehn aufgebaut ist. In der Informatik werden ebenfalls
Zahlensysteme verwendet, hierbei ist jedoch die Basis zehn oftmals
ungeeignet. Es kommen häufig das Dual- und das Hexadezimalsystem zum
Einsatz. Das Dualsystem wird häufig auch als Binärsystem bezeichnet.

In den Kapiteln 1.4.1 und 1.4.2 des Buches \emph{Grundkurs Informatik}\footnote{Hartmut Ernst, Jochen Schmidt und Gerd Beneken (2023): Grundkurs
Informatik, 6. Auflage, Springer Vieweg Wiesbaden,
\url{https://doi.org/10.1007/978-3-658-41779-6}},
das als ebook in der Bibliothek verfügbar ist, werden diese
Zahlensysteme gut verdeutlicht.

Machen Sie sich mit den Inhalten der Buchkapitel vertraut und lösen Sie
die folgende Aufgabe.
\begin{enumerate}
\item \textbf{Aufgabe 1}
\label{sec:org903cb66}

Wandeln Sie die Zahl \(5937_{10}\) vom Dezimalsystem in folgende
Zahlensysteme um:

\begin{enumerate}
\item Das Dualsystem,

\item das Hexadezimalsystem und

\item das Zahlensystem zur Basis 7.
\end{enumerate}

Geben Sie dabei die Rechenschritte detailliert und nachvollziehbar an.
\end{enumerate}
\subsubsection{\textbf{Mengen}}
\label{sec:org0dff8d6}

In der Vorlesung werden Sie sehr häufig mit Mengen in Kontakt kommen. Um
bereits im Vorhinein ein grundlegendes Verständnis davon zu erhalten,
was eine Menge ist und wie die Notation hierfür aussieht, sollten Sie
sich Kapitel 1.1 des Buches \emph{Mathematik für Informatiker}\footnote{Peter Hartmann (2019): Mathematik für Informatiker, 7. Auflage,
Springer Vieweg Wiesbaden,
\url{https://doi.org/10.1007/978-3-658-26524-3}}
verinnerlichen. Weiterhin lesen Sie Kapitel 3.1, welches Ihnen die Menge
der natürlichen Zahlen \(\mathbb{N}\) näher bringt.
\begin{enumerate}
\item \textbf{Aufgabe 2}
\label{sec:orgc58ee4b}

Notieren Sie repräsentative Teilmengen der folgenden Mengen mit jeweils
mindestens 8 Elementen:

\begin{enumerate}
\item Die natürlichen Zahlen \(\mathbb{N}\),

\item die ganzen Zahlen \(\mathbb{Z}\),

\item die rationalen Zahlen \(\mathbb{Q}\) und

\item die reellen Zahlen \(\mathbb{R}\).
\end{enumerate}
\item \textbf{Aufgabe 3}
\label{sec:org8bf9769}

Gegeben seien zwei Mengen \(A=\{a, b, x, y\}\) und \(B=\{a, b, c, d\}\).

\begin{enumerate}
\item Bilden Sie die Vereinigung \(A \cup B\).

\item Bilden Sie die Schnittmenge \(A \cap B\).

\item Bilden Sie die Differenz \(A \setminus B\).

\item Bilden Sie das kartesische Produkt \(A \times B\).

\item Bilden Sie das kartesische Produkt \(B \times A\).
\end{enumerate}
\end{enumerate}
\end{document}
